args = commandArgs()
basename = sub(".R$", "", sub("^--file=(.*/)?", "", args[grep("^--file=", args)]))
if (length(basename) != 0)
    pdf(file=paste0(basename, "_tmp.pdf"), colormodel="gray", width=5, height=3)
par(family="Palatino")
par(mgp=c(1.5,0.5,0)) # title and axis margins. default: c(3,1,0)
par(mar=c(3,3,1,1)+0.1) # bottom, left, top, right margins. default: c(5,4,4,2)+0.1

## xdata = c(1, 2, 3, 4, 5, 6)
## ydata = c(1, 3, 2, 4, 3, 5)
## xdata = xdata - mean(xdata)
## ydata = ydata - mean(ydata)
## set.seed(12345678)          # 乱数の初期化
## n = length(ydata)           # データの個数
## logpost = function(a, b, t) {  # 事後分布の対数
##   -0.5 * (n*t + sum((a*xdata+b-ydata)^2)/exp(t))
## }
## a = 0             # 適当な初期値
## b = 0             # 適当な初期値
## t = 0             # 適当な初期値
## lp = logpost(a, b, t) # 現在の事後分布の対数
## N = 1000000       # 繰返し数
## atrace = btrace = ttrace = numeric(N)  # 足跡を格納する配列
## for (i in 1:N) {
##   anew = rnorm(1, a, 1) # 次の候補
##   bnew = rnorm(1, b, 1) # 次の候補
##   tnew = rnorm(1, t, 1) # 次の候補
##   lq = logpost(anew, bnew, tnew)  # 次の候補の事後分布の対数
##   if (lp - lq < rexp(1)) {        # メトロポリスの更新（対数版）
##     a = anew
##     b = bnew
##     t = tnew
##     lp = lq
##   }
##   atrace[i] = a    # 配列に格納
##   btrace[i] = b    # 配列に格納
##   ttrace[i] = t    # 配列に格納
## }

hx = seq(-9.975, 9.975, 0.05)
hy = c(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0,
0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 2, 3, 0, 0, 0, 0, 0, 1,
1, 7, 1, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0,
1, 0, 0, 6, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 2, 1, 0, 3, 0, 0,
1, 0, 0, 0, 1, 0, 2, 1, 2, 3, 0, 1, 2, 1, 0, 2, 0, 1, 2, 2, 18, 6, 7,
1, 1, 2, 10, 11, 9, 8, 4, 23, 17, 14, 31, 17, 38, 23, 22, 57, 36, 78,
92, 51, 58, 134, 151, 150, 164, 190, 233, 329, 348, 465, 446, 596,
772, 965, 1128, 1548, 2008, 2543, 3090, 4320, 5224, 7273, 9606, 13082,
17407, 22766, 32099, 41298, 50739, 65025, 75074, 82856, 87659, 87186,
77178, 67492, 52848, 41480, 32024, 23946, 18481, 14256, 10604, 7213,
5869, 4339, 3324, 2588, 2070, 1488, 1226, 1019, 777, 657, 493, 454,
433, 272, 209, 234, 131, 146, 114, 119, 111, 131, 72, 67, 87, 46, 39,
64, 29, 26, 27, 19, 28, 10, 31, 14, 18, 12, 12, 17, 0, 18, 5, 2, 3, 8,
7, 4, 10, 8, 0, 7, 4, 0, 4, 0, 1, 0, 0, 3, 0, 0, 2, 0, 0, 0, 0, 0, 0,
0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)

hist(rep(hx,hy), breaks=seq(-10,10,0.05), freq=FALSE, col=gray(0.9),
     xlim=c(-0.5,2), xlab=expression(italic(a)), ylab="", main="")
curve(dt((x-0.6286)/0.2100, 4)/0.2100, add=TRUE)

dev.off()
embedFonts(paste0(basename, "_tmp.pdf"), outfile=paste0(basename, ".pdf"),
           options="-c \"<</NeverEmbed []>> setdistillerparams\" -f ")
